GrumpyOldPizza/ArduinoCore-stm32l0/tools/share/SVD/STM32WB15_CM4.svd
        <register>
          <name>C2AHB2SMENR</name>
          <displayName>C2AHB2SMENR</displayName>
          <description>CPU2 AHB2 peripheral clocks enable in Sleep           and Stop modes register</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0001209F</resetValue>
          <fields>
            <field>
              <name>AES1SMEN</name>
              <description>CPU2 AES1 accelerator clocks enable               during Sleep and Stop modes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCFSSMEN</name>
              <description>CPU2 ADC clocks enable during Sleep and               Stop modes</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOHSMEN</name>
              <description>CPU2 IO port H clocks enable during               Sleep and Stop modes</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOESMEN</name>
              <description>CPU2 IO port E clocks enable during               Sleep and Stop modes</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIODSMEN</name>
              <description>CPU2 IO port D clocks enable during               Sleep and Stop modes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOCSMEN</name>
              <description>CPU2 IO port C clocks enable during               Sleep and Stop modes</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOBSMEN</name>
              <description>CPU2 IO port B clocks enable during               Sleep and Stop modes</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOASMEN</name>
              <description>CPU2 IO port A clocks enable during               Sleep and Stop modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2AHB3SMENR</name>
          <displayName>C2AHB3SMENR</displayName>
          <description>CPU2 AHB3 peripheral clocks enable in Sleep           and Stop modes register</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x03070000</resetValue>
          <fields>
            <field>
              <name>FLASHSMEN</name>
              <description>Flash interface clocks enable during               CPU2 sleep modes</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2SMEN</name>
              <description>SRAM2a and SRAM2b memory interface               clocks enable during CPU2 sleep modes</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNGSMEN</name>
              <description>True RNG clocks enable during CPU2 sleep               modes</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AES2SMEN</name>
              <description>AES2 accelerator clocks enable during               CPU2 sleep modes</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKASMEN</name>
              <description>PKA accelerator clocks enable during               CPU2 sleep modes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB1SMENR1</name>
          <displayName>C2APB1SMENR1</displayName>
          <description>CPU2 APB1SMENR1</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x85A04601</resetValue>
          <fields>
            <field>
              <name>LPTIM1SMEN</name>
              <description>Low power timer 1 clocks enable during               CPU2 Sleep mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBSMEN</name>
              <description>USB FS clocks enable during CPU2 Sleep               mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRSMEN</name>
              <description>CRS clocks enable during CPU2 Sleep               mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3SMEN</name>
              <description>I2C3 clocks enable during CPU2 Sleep               mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1SMEN</name>
              <description>I2C1 clocks enable during CPU2 Sleep               mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI2SMEN</name>
              <description>SPI2 clocks enable during CPU2 Sleep               mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCAPBSMEN</name>
              <description>RTC APB clocks enable during CPU2 Sleep               mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCDSMEN</name>
              <description>LCD clocks enable during CPU2 Sleep               mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM2SMEN</name>
              <description>TIM2 timer clocks enable during CPU2               Sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB1SMENR2</name>
          <displayName>C2APB1SMENR2</displayName>
          <description>CPU2 APB1 peripheral clocks enable in Sleep           and Stop modes register 2</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000021</resetValue>
          <fields>
            <field>
              <name>LPTIM2SMEN</name>
              <description>Low power timer 2 clocks enable during               CPU2 Sleep mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART1SMEN</name>
              <description>Low power UART 1 clocks enable during               CPU2 Sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB2SMENR</name>
          <displayName>C2APB2SMENR</displayName>
          <description>CPU2 APB2SMENR</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00265800</resetValue>
          <fields>
            <field>
              <name>SAI1SMEN</name>
              <description>SAI1 clocks enable during CPU2 Sleep               mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM17SMEN</name>
              <description>TIM17 timer clocks enable during CPU2               Sleep mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM16SMEN</name>
              <description>TIM16 timer clocks enable during CPU2               Sleep mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1SMEN</name>
              <description>USART1clocks enable during CPU2 Sleep               mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1SMEN</name>
              <description>SPI1 clocks enable during CPU2 Sleep               mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM1SMEN</name>
              <description>TIM1 timer clocks enable during CPU2               Sleep mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2APB3SMENR</name>
          <displayName>C2APB3SMENR</displayName>
          <description>CPU2 APB3SMENR</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000003</resetValue>
          <fields>
            <field>
              <name>SMEN802</name>
              <description>802.15.4 interface clocks enable during               CPU2 Sleep modes</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLESMEN</name>
              <description>BLE interface clocks enable during CPU2               Sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
